posts/scalaxue-xi-bi-ji/index.html
<!DOCTYPE html>
<html prefix="" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>scala学习笔记 | Abner Zheng's Blog</title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://abnerzheng.github.io/posts/scalaxue-xi-bi-ji/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Abner Zheng">
<link rel="prev" href="../b-tree-suo-ji-zhu-yan-jiu/" title="B-tree 锁技术研究(翻译)" type="text/html">
<link rel="next" href="../reactive-programming-learning-note/" title="Reactive Programming Learning Note" type="text/html">
<meta property="og:site_name" content="Abner Zheng's Blog">
<meta property="og:title" content="scala学习笔记">
<meta property="og:url" content="https://abnerzheng.github.io/posts/scalaxue-xi-bi-ji/">
<meta property="og:description" content="包管理


简介


Scala的包管理和大体上和Java类似，都是使用import关键字来实现，但它更灵活:



import声明可以放在任意地方

可以import的东西包括类、包和对象

在导入的时候可以隐藏(使用_)和rename(使用=&gt;)

可以使用类似于C++中的namespace方法来使用package




区别:


java使用的是 '*' 而scala是用的是''


">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-02-07T14:38:37+08:00">
<meta property="article:tag" content="mathjax">
</head>
<body class="theme-base-08">
    <a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">文章存档</a>
        <a class="sidebar-nav-item" href="../../categories/">标签</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS 源</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://abnerzheng.github.io/" title="Abner Zheng's Blog" rel="home">Abner Zheng's Blog</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">scala学习笔记</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Abner Zheng</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2018-02-07T14:38:37+08:00" itemprop="datePublished" title="2018-02-07 14:38">2018-02-07 14:38</time></a></p>
                <p class="commentline">
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/scalaxue-xi-bi-ji.html">评论</a>


        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <!--TEASER_END-->



<div id="outline-container-sec-0-1" class="outline-3">
<h3 id="sec-0-1">包管理</h3>
<div class="outline-text-3" id="text-0-1">
</div>
<div id="outline-container-sec-0-1-1" class="outline-4">
<h4 id="sec-0-1-1">简介</h4>
<div class="outline-text-4" id="text-0-1-1">
<p>
Scala的包管理和大体上和Java类似，都是使用import关键字来实现，但它更灵活:
</p>

<ul class="org-ul">
<li>import声明可以放在任意地方
</li>
<li>可以import的东西包括类、包和对象
</li>
<li>在导入的时候可以隐藏(使用_)和rename(使用=&gt;)
</li>
<li>可以使用类似于C++中的namespace方法来使用package
</li>
</ul>
<p>
区别:
</p>
<ul class="org-ul">
<li>java使用的是 '*' 而scala是用的是'<sub>'</sub>
</li>
</ul>
<p>
所有在scala.Predef(David Pollak 强烈建议阅读的代码)定义的对象都已经隐形导入到所有类中，均可使用。
</p>

<p>
Scala支持 <code>import java.io.{File, IOException, FileNotFoundException}</code>  这种语法来同时导入多个类或对象
</p>

<p>
在使用通配符"_"的时候往往又有需要排除一些类的导入的场景，这种情况下，可以使用一下的语法来实现 <code>import java.util.{Random =&gt; _, _}</code> ，这样就可以把Random隐藏了并且把其他所有的都导入。
</p>
</div>
</div>

<div id="outline-container-sec-0-1-2" class="outline-4">
<h4 id="sec-0-1-2">Traits</h4>
<div class="outline-text-4" id="text-0-1-2">
<p>
Traits是java中interface的极大加强版本。 Scala中一个类也可以extend多个traits。
</p>

<p>
Scala多extend的语法如下
</p>

<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Foo</span> <span class="k">extends</span> <span class="nc">BaseClass</span> <span class="k">with</span> <span class="nc">Trait1</span> <span class="k">with</span> <span class="nc">Trait2</span> <span class="o">{</span>
<span class="o">}</span>
</pre></div>

<p>
当一个类extend一个trait的时候就必须要实现它定义的所有方法，如果做不到，则要声明该类为abstract。
</p>
</div>


<ul class="org-ul"><li>
<a id="sec-0-1-2-1" name="sec-0-1-2-1"></a>field<br><div class="outline-text-5" id="text-0-1-2-1">
<p>
如果在Traits定义中只给出一个field的类型而不赋值，那么该field就是为抽象的，否则为具体的。 field可以用var和val定义，var定义的不必加上override，而val则必须要。
</p>

<p>
<b>**</b>
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-0-1-3" class="outline-4">
<h4 id="sec-0-1-3">函数式编程</h4>
<div class="outline-text-4" id="text-0-1-3">
<p>
Collect方法与map方法的不同：colect方法会测试该函数的isDefinedAt,只有满足条件的才会被收集，而map则不会，当不满足的时候，可能会报错。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-0-2" class="outline-3">
<h3 id="sec-0-2">集合</h3>
<div class="outline-text-3" id="text-0-2">
</div>
<div id="outline-container-sec-0-2-1" class="outline-4">
<h4 id="sec-0-2-1">Collections Hierarchy</h4>
<div class="outline-text-4" id="text-0-2-1">
<p>
Scala所有的集合类起始于Traversable和Iterable这两个traits，然后扩展到三大类：
</p>
<ul class="org-ul">
<li>Seq
</li>
<li>Set
</li>
<li>Map
</li>
</ul>
<p>
默认导入Map是immutable的，mutable的需要重新导入。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left"> </th>
<th scope="col" class="left">Immutable</th>
<th scope="col" class="left">Mutable</th>
</tr></thead>
<tbody>
<tr>
<td class="left">Indexed</td>
<td class="left">Vector</td>
<td class="left">ArrayBuffer</td>
</tr>
<tr>
<td class="left">Linear(Linked lists)</td>
<td class="left">List</td>
<td class="left">ListBuffer</td>
</tr>
</tbody>
</table>
<p>
不可修改Seq的选择标准:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above">
<span class="table-number">Table 1:</span> Main immutable sequence choices</caption>

<colgroup>
<col class="left">
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left"> </th>
<th scope="col" class="left">IndexedSeq</th>
<th scope="col" class="left">LinearSeq</th>
<th scope="col" class="left">Description</th>
</tr></thead>
<tbody>
<tr>
<td class="left">List</td>
<td class="left"> </td>
<td class="left">\(\surd\)</td>
<td class="left">单链表,有head、tail适合做递归</td>
</tr>
<tr>
<td class="left">Queue</td>
<td class="left"> </td>
<td class="left">\(\surd\)</td>
<td class="left">先进先出</td>
</tr>
<tr>
<td class="left">Range</td>
<td class="left">\(\surd\)</td>
<td class="left"> </td>
<td class="left"> </td>
</tr>
<tr>
<td class="left">Stack</td>
<td class="left"> </td>
<td class="left">\(\surd\)</td>
<td class="left">后进先出</td>
</tr>
<tr>
<td class="left">Stream</td>
<td class="left"> </td>
<td class="left">\(\surd\)</td>
<td class="left">与 <code>List</code> 类似,但是它是Lazy和persitent的， 与haskell中的 <code>List</code> 类似</td>
</tr>
<tr>
<td class="left">String</td>
<td class="left">\(\surd\)</td>
<td class="left"> </td>
<td class="left"> </td>
</tr>
<tr>
<td class="left">Vector</td>
<td class="left">\(\surd\)</td>
<td class="left"> </td>
<td class="left">方便进行Split和join操作</td>
</tr>
</tbody>
</table>
<p>
可修改Seq的选择标准：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above">
<span class="table-number">Table 2:</span> Main mutable Sequece Choices</caption>

<colgroup>
<col class="left">
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left"> </th>
<th scope="col" class="left">Indexed</th>
<th scope="col" class="left">LinearSeq</th>
<th scope="col" class="left">Description</th>
</tr></thead>
<tbody>
<tr>
<td class="left">Array</td>
<td class="left">\(\surd\)</td>
<td class="left"> </td>
<td class="left">底层由java的Array实现,length不可变</td>
</tr>
<tr>
<td class="left">ArrayBuffer</td>
<td class="left">\(\surd\)</td>
<td class="left"> </td>
<td class="left">可扩展的Array</td>
</tr>
<tr>
<td class="left"> </td>
<td class="left"> </td>
<td class="left"> </td>
<td class="left"> </td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-0-2-2" class="outline-4">
<h4 id="sec-0-2-2">Extractors</h4>
<div class="outline-text-4" id="text-0-2-2">
<p>
模式匹配依赖于提取器的存在。Case class由编译器自动帮助创建了一个company object，其中不仅仅有一个`apply` 方法，同时还有一个`unapply`方法。而如果是自己写的class,如果想使用match方法的话，就必须要自己在该class的company object中实现一个`unapply`方法。`unapply`的函数签名为
</p>

<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">unapply</span><span class="o">(</span><span class="n">object</span><span class="k">:</span> <span class="kt">S</span><span class="o">)</span><span class="k">:</span> <span class="kt">Option</span><span class="o">[(</span><span class="kt">T1</span>,<span class="kt">...</span>,<span class="kt">Tn</span><span class="o">)]</span>
</pre></div>
</div>

<ul class="org-ul"><li>
<a id="sec-0-2-2-1" name="sec-0-2-2-1"></a>Boolean Extractor<br><div class="outline-text-5" id="text-0-2-2-1">
<p>
实际上，在pattern match中，并不一定需要返回数据，很多时候所需要的，仅仅是返回一个boolean，这个时候Boolean Extractor就排上了用场。他的签名为：
</p>

<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">unapply</span><span class="o">(</span><span class="n">object</span><span class="k">:</span> <span class="kt">S</span><span class="o">)</span><span class="k">:</span> <span class="kt">Boolean</span>
</pre></div>

<p>
使用在`match pattern`中，只有当unapply返回true的时候，才会被匹配上，如果返回false，则尝试下一个case。
</p>

<p>
Boolean Extractor的用法略有不同，同时不用传入任何参数，如果需要取得匹配到的变量，可以使用@运算符将该值绑定到一个变量上, 如：
</p>

<div class="highlight"><pre><span></span><span class="k">object</span> <span class="nc">premiumCandidate</span> <span class="o">{</span>
  <span class="k">def</span> <span class="n">unapply</span><span class="o">(</span><span class="n">user</span><span class="k">:</span> <span class="kt">FreeUser</span><span class="o">)</span><span class="k">:</span> <span class="kt">Boolean</span> <span class="o">=</span> <span class="n">user</span><span class="o">.</span><span class="n">upgradeProbability</span> <span class="o">&gt;</span> <span class="mi">75</span>
<span class="o">}</span> <span class="n">bd</span>

<span class="k">val</span> <span class="n">user</span><span class="k">:</span> <span class="kt">User</span> <span class="o">=</span> <span class="k">new</span> <span class="nc">FreeUser</span><span class="o">(</span><span class="s">"Daniel"</span><span class="o">,</span> <span class="mi">2500</span><span class="o">,</span> <span class="mf">0.5d</span><span class="o">)</span>
<span class="n">user</span> <span class="k">match</span> <span class="o">{</span>
  <span class="k">case</span> <span class="n">freeUser</span><span class="k">@</span> <span class="n">premiumCandidate</span><span class="o">()</span> <span class="k">=&gt;</span> <span class="n">initiateSpanProgram</span><span class="o">(</span><span class="n">freeUser</span><span class="o">)</span>
  <span class="k">case</span> <span class="k">_</span> <span class="k">=&gt;</span> <span class="n">sendRegularNewsletter</span><span class="o">(</span><span class="n">user</span><span class="o">)</span>
<span class="o">}</span>
</pre></div>


<div class="highlight"><pre><span></span><span class="n">print</span><span class="o">(</span><span class="mi">12</span><span class="o">)</span>
</pre></div>
</div>
</li></ul>
</div>
</div>










<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">高级主题</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-0-1" class="outline-4">
<h4 id="sec-1-0-1">Effect</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
Effect是一种所谓的phantom type(幻影类型), 它没有运行时实例，仅有的目的是给编译器一些额外信息来做一些条件判断。
</p>

<p>
<b>*</b>
</p>
</div>
</div>
</div>












<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Codewars练习</h2>
<div class="outline-text-2" id="text-2">
<p>
光看肯定是没用的，还得练习！
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><a href="https://www.codewars.com/kata/57339a5226196a7f90001bcf/train/scala">N-point Crossover&lt;6kyu&gt;</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
这题就是个模拟题，很简单。 但是其实可以不按模拟做，用负负得正就可以确定每一个位置上是否需要转换.
</p>

<p>
我自己写的解法如下
</p>


<div class="highlight"><pre><span></span><span class="k">object</span> <span class="nc">NPointCrossover</span> <span class="o">{</span>

  <span class="k">def</span> <span class="n">crossover</span><span class="o">[</span><span class="kt">T</span><span class="o">](</span><span class="n">ns</span><span class="k">:</span> <span class="kt">List</span><span class="o">[</span><span class="kt">Int</span><span class="o">],</span> <span class="n">xs</span><span class="k">:</span> <span class="kt">List</span><span class="o">[</span><span class="kt">T</span><span class="o">],</span> <span class="n">ys</span><span class="k">:</span> <span class="kt">List</span><span class="o">[</span><span class="kt">T</span><span class="o">])</span><span class="k">:</span> <span class="o">(</span><span class="kt">List</span><span class="o">[</span><span class="kt">T</span><span class="o">],</span> <span class="nc">List</span><span class="o">[</span><span class="kt">T</span><span class="o">])</span> <span class="k">=</span> <span class="o">{</span>
    <span class="c1">// ns 去重并且从小到大排列</span>
    <span class="k">val</span> <span class="n">nss</span> <span class="k">=</span> <span class="n">ns</span><span class="o">.</span><span class="n">distinct</span>
    <span class="k">val</span> <span class="n">result1</span> <span class="k">=</span> <span class="n">xs</span><span class="o">.</span><span class="n">zip</span><span class="o">(</span><span class="n">ys</span><span class="o">).</span><span class="n">zipWithIndex</span><span class="o">.</span><span class="n">map</span><span class="o">{</span> <span class="k">case</span> <span class="o">((</span><span class="n">ele1</span><span class="o">,</span><span class="n">ele2</span><span class="o">),</span> <span class="n">index</span><span class="o">)</span> <span class="k">=&gt;</span> <span class="o">{</span>
						<span class="k">if</span><span class="o">(</span><span class="n">nss</span><span class="o">.</span><span class="n">filter</span><span class="o">(</span><span class="k">_</span><span class="o">&lt;=</span><span class="n">index</span><span class="o">).</span><span class="n">size</span> <span class="o">%</span> <span class="mi">2</span> <span class="o">==</span> <span class="mi">1</span><span class="o">)</span>
						  <span class="o">(</span><span class="n">ele2</span><span class="o">,</span> <span class="n">ele1</span><span class="o">)</span>
						<span class="k">else</span>
						  <span class="o">(</span><span class="n">ele1</span><span class="o">,</span> <span class="n">ele2</span><span class="o">)</span>
					      <span class="o">}</span>
    <span class="o">}</span>
    <span class="n">result1</span><span class="o">.</span><span class="n">unzip</span>
  <span class="o">}</span>
<span class="o">}</span>
</pre></div>

<p>
看了一圈别人的解法，我这个应该算比较完美的了。哈哈哈
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><a href="https://www.codewars.com/kata/54b42f9314d9229fd6000d9c/train/scala">Duplicate Encoder</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
这题很简单， 就是一个word count
</p>

<p>
我的解法:
</p>

<div class="highlight"><pre><span></span><span class="k">object</span> <span class="nc">Solution</span> <span class="o">{</span>

  <span class="k">def</span> <span class="n">duplicateEncode</span><span class="o">(</span><span class="n">word</span><span class="k">:</span> <span class="kt">String</span><span class="o">)</span> <span class="k">=</span> <span class="o">{</span>
    <span class="k">val</span> <span class="n">m</span> <span class="k">=</span> <span class="n">word</span><span class="o">.</span><span class="n">toLowerCase</span><span class="o">.</span><span class="n">groupBy</span><span class="o">(</span><span class="n">x</span><span class="k">=&gt;</span><span class="n">x</span><span class="o">)</span>
    <span class="n">word</span><span class="o">.</span><span class="n">toLowerCase</span><span class="o">.</span><span class="n">map</span><span class="o">(</span><span class="n">x</span><span class="o">=&gt;{</span> <span class="k">if</span> <span class="o">(</span><span class="n">m</span><span class="o">.</span><span class="n">get</span><span class="o">(</span><span class="n">x</span><span class="o">).</span><span class="n">getOrElse</span><span class="o">(</span><span class="s">""</span><span class="o">).</span><span class="n">size</span> <span class="o">&gt;</span> <span class="mi">1</span><span class="o">)</span> <span class="sc">')'</span> <span class="k">else</span> <span class="sc">'('</span><span class="o">})</span>
  <span class="o">}</span>
<span class="o">}</span>
</pre></div>

<p>
看了下别人的解法，有个比较好的方法是在将size的判断提前，使用mapValues(_.size) 可以对Map中的value进行梳理，可以减少不必要的重复计算.还有个人，他不用这种map，直接通过index和lastIndex得到的两个索引值是否相等来判断是不是只出现过一次，这个是比较聪明的做法，摘录代码如下:
</p>


<div class="highlight"><pre><span></span><span class="k">object</span> <span class="nc">Solution</span> <span class="o">{</span>

  <span class="k">def</span> <span class="n">duplicateEncode</span><span class="o">(</span><span class="n">word</span><span class="k">:</span> <span class="kt">String</span><span class="o">)</span> <span class="k">=</span> <span class="o">{</span>
    <span class="k">val</span> <span class="n">w</span> <span class="k">=</span> <span class="n">word</span><span class="o">.</span><span class="n">toLowerCase</span>
    <span class="n">w</span><span class="o">.</span><span class="n">map</span> <span class="o">{</span>
      <span class="k">case</span> <span class="n">l</span> <span class="k">if</span> <span class="n">w</span><span class="o">.</span><span class="n">indexOf</span><span class="o">(</span><span class="n">l</span><span class="o">)</span> <span class="o">==</span> <span class="n">w</span><span class="o">.</span><span class="n">lastIndexOf</span><span class="o">(</span><span class="n">l</span><span class="o">)</span> <span class="k">=&gt;</span> <span class="s">"("</span>
      <span class="k">case</span> <span class="k">_</span> <span class="k">=&gt;</span> <span class="s">")"</span>
    <span class="o">}.</span><span class="n">mkString</span>
  <span class="o">}</span>
<span class="o">}</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><i>Are they the "same"?&lt;6kyu&gt;</i></h3>
<div class="outline-text-3" id="text-2-3">
<p>
太简单了
</p>

<div class="highlight"><pre><span></span><span class="k">object</span> <span class="nc">Solution</span> <span class="o">{</span>
  <span class="k">def</span> <span class="n">comp</span><span class="o">(</span><span class="n">seq1</span><span class="k">:</span> <span class="kt">Seq</span><span class="o">[</span><span class="kt">Int</span><span class="o">],</span> <span class="n">seq2</span><span class="k">:</span> <span class="kt">Seq</span><span class="o">[</span><span class="kt">Int</span><span class="o">])</span> <span class="k">=</span> <span class="o">{</span>
      <span class="k">if</span><span class="o">(</span><span class="n">seq2</span> <span class="o">==</span> <span class="kc">null</span><span class="o">){</span>
	<span class="kc">false</span>
      <span class="o">}</span><span class="k">else</span><span class="o">{</span>
      <span class="n">seq2</span><span class="o">.</span><span class="n">diff</span><span class="o">(</span><span class="n">seq1</span><span class="o">.</span><span class="n">map</span><span class="o">(</span><span class="n">x</span><span class="k">=&gt;</span><span class="n">x</span><span class="o">*</span><span class="n">x</span><span class="o">)).</span><span class="n">size</span> <span class="o">==</span> <span class="mi">0</span>
      <span class="o">}</span>
  <span class="o">}</span>
<span class="o">}</span>
</pre></div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags"></ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../b-tree-suo-ji-zhu-yan-jiu/" rel="prev" title="B-tree 锁技术研究(翻译)">上一篇文章</a>
            </li>
            <li class="next">
                <a href="../reactive-programming-learning-note/" rel="next" title="Reactive Programming Learning Note">下一篇文章</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>评论</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="abnerzhengblog",
            disqus_url="https://abnerzheng.github.io/posts/scalaxue-xi-bi-ji/",
        disqus_title="scala\u5b66\u4e60\u7b14\u8bb0",
        disqus_identifier="cache/posts/scalaxue-xi-bi-ji.html",
        disqus_config = function () {
            this.language = "zh_cn";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section><script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha384-3lJUsx1TJHt7BA4udB5KPnDrlkO8T6J6v/op7ui0BbCjvZ9WqV4Xm6DTP6kQ/iBH" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
        MathJax.Hub.Config({tex2jax: {inlineMath: [['$latex ','$'], ['\\(','\\)']]}});
        </script></article><script>var disqus_shortname="abnerzhengblog";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script><footer id="footer"><p>Contents © 2020         <a href="mailto:abnerzheng@gmail.com">Abner Zheng</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
